import React from 'preact';
const { Fragment } = React;

export const announcement = {
	'2019-06-01': (
		<Fragment>
			<p>
		收到很多建议说希望能直接输入升级项目的现等级和目标等级的功能，这周末会努力做出来的~<br />
		顺便会把等级提升和经验卡的需求也添加进来<br />
		但直接做在主界面会有点乱，现在的考虑是会开一个新页面【干员培养】
				<ul>
					<li>输入现在的等级、精英化等级、技能等级和目标等级</li>
					<li>会生成对应的数据条添加回主界面</li>
					<li>接下来就和原来的使用逻辑一样了</li>
				</ul>
			</p>
			<p>
		关于移动端适配，有一些些复杂，需要考虑交互问题，缩小界面会很难用<br />
		而且在手机上来回切换游戏和工具也挺麻烦的<br />
		比较舒服的使用场景还是使用额外的屏幕打开本工具<br />
		但总的来说我还是会尽量去做的，谢谢大家支持<br />
		祝大家儿童节快乐~
			</p>
			<p>（小声）在下面更新了打赏链接0w0，如果大佬们愿意支持的话……</p>
		</Fragment>
	),
};

const ArkHistory = () => (
	<div>
		<h3>V1.2.2</h3>
		<ul>
			<li>增加了数据备份功能</li>
			<li>优化了界面布局</li>
		</ul>
		<h3>V1.2.1</h3>
		<ul>
			<li>增加了快捷库存操作</li>
			<li>改变了界面布局</li>
		</ul>
		<h3>V1.2.0</h3>
		<ul>
			<li>增加了材料合成计算相关功能</li>
			<li>增加了追踪材料功能</li>
			<li>完善了材料卡片布局</li>
		</ul>
		<h3>V1.1.0</h3>
		<ul>
			<li>增加了材料卡片</li>
			<li>增加了追踪材料功能</li>
			<li>改变了界面布局</li>
		</ul>
		<h3>V1.0.4</h3>
		<ul>
			<li>进一步提高了干员名称拼音输入查找的准确性</li>
			<li>修复了一些操作Bug</li>
		</ul>
		<h3>V1.0.3</h3>
		<ul>
			<li>添加了材料图标</li>
			<li>修复了Edge选项显示不正确的Bug</li>
		</ul>
		<h3>V1.0.2</h3>
		<ul>
			<li>调整了添加干员按钮位置</li>
			<li>提高了干员名称拼音输入查找的准确性</li>
		</ul>
		<h3>V1.0.1</h3>
		<ul><li>实现了干员名称拼音输入查找.β</li></ul>
		<h3>V1.0.0</h3>
		<ul><li>实现了基本功能</li></ul>
		<hr />
	</div>
);

export default ArkHistory;
